read_verilog rowidct.v
synth_xilinx -top rowidct
write_verilog rowidct_synth.v